app/views/test_passages/show.html.erb

                  data: {
                    current_question: @test_passage.question_number,
                    all_question: @test_passage.test.questions.size
---
SELECT  "questions".* FROM "questions" WHERE "questions"."test_id" = ? AND (id > 1) ORDER BY "questions"."id" ASC LIMIT ?  [["test_id", 1], ["LIMIT", 1]]
SELECT  "tests".* FROM "tests" WHERE "tests"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "questions" WHERE "questions"."test_id" = ?  [["test_id", 2]]