app/controllers/test_passages_controller.rb

SELECT  "test_passages".* FROM "test_passages" WHERE "test_passages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_test_passage
    @test_passage = TestPassage.find(params[:id])