app/models/test_passage.rb

SELECT COUNT(*) FROM "questions" WHERE "questions"."test_id" = ?  [["test_id", 1]]
---
  def result_to_percent
    correct_questions.to_f / test.questions.count * 100

SELECT COUNT(*) FROM "questions" WHERE "questions"."test_id" = ? AND (id < 3)  [["test_id", 2]]
---
  def question_number
    test.questions.where('id < ?', current_question.id).count + 1

SELECT  "questions".* FROM "questions" WHERE "questions"."test_id" = ? ORDER BY "questions"."id" ASC LIMIT ?  [["test_id", 2], ["LIMIT", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."test_id" = ? AND (id > 1) ORDER BY "questions"."id" ASC LIMIT ?  [["test_id", 1], ["LIMIT", 1]]
SELECT  "tests".* FROM "tests" WHERE "tests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def next_question
    return test.questions.first if current_question.nil?
    test.questions.order(:id).where('id > ?', current_question.id).first